wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_i2c.h
/*!
    \file    gd32f50x_i2c.h
    \brief   definitions for the I2C

    \version 2025-11-10, V1.01, firmware for GD32F50x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32F50X_I2C_H
#define GD32F50X_I2C_H

#include "gd32f50x.h"

/* I2Cx(x=0,1) definitions */
#define I2C0                            I2C_BASE                        /*!< I2C0 base address */
#define I2C1                            (I2C_BASE+0x00000400U)          /*!< I2C1 base address */

/* registers definitions */
#define I2C_CTL0(i2cx)                  REG32((i2cx) + 0x00000000U)     /*!< I2C control register 0 */
#define I2C_CTL1(i2cx)                  REG32((i2cx) + 0x00000004U)     /*!< I2C control register 1 */
#define I2C_SADDR0(i2cx)                REG32((i2cx) + 0x00000008U)     /*!< I2C slave address register 0*/
#define I2C_SADDR1(i2cx)                REG32((i2cx) + 0x0000000CU)     /*!< I2C slave address register 1*/
#define I2C_TIMING(i2cx)                REG32((i2cx) + 0x00000010U)     /*!< I2C timing register */
#define I2C_TIMEOUT(i2cx)               REG32((i2cx) + 0x00000014U)     /*!< I2C timeout register */
#define I2C_STAT(i2cx)                  REG32((i2cx) + 0x00000018U)     /*!< I2C status register */
#define I2C_STATC(i2cx)                 REG32((i2cx) + 0x0000001CU)     /*!< I2C status clear register */
#define I2C_PEC(i2cx)                   REG32((i2cx) + 0x00000020U)     /*!< I2C PEC register */
#define I2C_RDATA(i2cx)                 REG32((i2cx) + 0x00000024U)     /*!< I2C receive data register */
#define I2C_TDATA(i2cx)                 REG32((i2cx) + 0x00000028U)     /*!< I2C transmit data register */
#define I2C_CTL2(i2cx)                  REG32((i2cx) + 0x00000090U)     /*!< I2C control register 2 */

/* bits definitions */
/* I2Cx_CTL0 */
#define I2C_CTL0_I2CEN                  BIT(0)                          /*!< I2C peripheral enable */
#define I2C_CTL0_TIE                    BIT(1)                          /*!< transmit interrupt enable */
#define I2C_CTL0_RBNEIE                 BIT(2)                          /*!< receive interrupt enable */
#define I2C_CTL0_ADDMIE                 BIT(3)                          /*!< address match interrupt enable in slave mode */
#define I2C_CTL0_NACKIE                 BIT(4)                          /*!< not acknowledge received interrupt enable */
#define I2C_CTL0_STPDETIE               BIT(5)                          /*!< stop detection interrupt enable */
#define I2C_CTL0_TCIE                   BIT(6)                          /*!< transfer complete interrupt enable */
#define I2C_CTL0_ERRIE                  BIT(7)                          /*!< error interrupt enable */
#define I2C_CTL0_DNF                    BITS(8,11)                      /*!< digital noise filter */
#define I2C_CTL0_ANOFF                  BIT(12)                         /*!< analog noise filter */
#define I2C_CTL0_DENT                   BIT(14)                         /*!< DMA enable for transmission */
#define I2C_CTL0_DENR                   BIT(15)                         /*!< DMA enable for reception */
#define I2C_CTL0_SBCTL                  BIT(16)                         /*!< slave byte control */
#define I2C_CTL0_SS                     BIT(17)                         /*!< whether to stretch SCL low when data is not ready in slave mode */
#define I2C_CTL0_GCEN                   BIT(19)                         /*!< whether or not to response to a general call (0x00) */
#define I2C_CTL0_SMBHAEN                BIT(20)                         /*!< SMBus host address enable */
#define I2C_CTL0_SMBDAEN                BIT(21)                         /*!< SMBus device default address enable */
#define I2C_CTL0_SMBALTEN               BIT(22)                         /*!< SMBus alert enable */
#define I2C_CTL0_PECEN                  BIT(23)                         /*!< PEC calculation switch */

/* I2Cx_CTL1 */
#define I2C_CTL1_SADDRESS               BITS(0,9)                       /*!< received slave address */
#define I2C_CTL1_TRDIR                  BIT(10)                         /*!< transfer direction in master mode */
#define I2C_CTL1_ADD10EN                BIT(11)                         /*!< 10-bit addressing mode enable in master mode */
#define I2C_CTL1_HEAD10R                BIT(12)                         /*!< 10-bit address header executes read direction only in master receive mode */
#define I2C_CTL1_START                  BIT(13)                         /*!< generate a START condition on I2C bus */
#define I2C_CTL1_STOP                   BIT(14)                         /*!< generate a STOP condition on I2C bus */
#define I2C_CTL1_NACKEN                 BIT(15)                         /*!< generate NACK in slave mode */
#define I2C_CTL1_BYTENUM                BITS(16,23)                     /*!< number of bytes to be transferred */
#define I2C_CTL1_RELOAD                 BIT(24)                         /*!< reload mode enable */
#define I2C_CTL1_AUTOEND                BIT(25)                         /*!< automatic end mode in master mode */
#define I2C_CTL1_PECTRANS               BIT(26)                         /*!< PEC transfer */

